
'''  list
   append()   Добавляет элемент в конец списка
   insert(i, x)  Добавляет в список новый элемент x на место с индексом i
   remove(x)     Удаляет первый элемент в списке имеющий значение x
   extend(L)     Расширяет список , добавляя в конец  все элементы списка L
   cort([key=функция])  Сортирует список на основе функции, а по умолчанию в порядке возрастания элементов

       str
    len()         Выводит длинну строки
    split()       Разбивает строку по разделителя , по умолченияю по пробелу
    replace(старый, новый)       Замена элемента старого на новый
     S(i)                     Обращение к элементы по индексу
     find(str, [start], [end])    Первое появление элемента в строке , или подстроки в отрезке от start до end

          set
      add()       Добавляет элемент в конец множества
       x in s           Проверка пренадлежит ли x  множеству  s
       discard()         Удаляет элемент если он находится в множестве
       intersection()       Пересечение множеств
       update()           Объединение множеств

            dist
        get()           Возвращает значение ключа , и не выдает ошибку если его нет
        items()         Возвращает пару ключ значение
        keys()         Возвращает ключи в словаре
        values()        Возвращает значения в словаре
        dict[keys] = value        Добавляет пару , либо заменяет значение по ключу  '''